PROGRAM MinSort3 (INPUT,OUTPUT);
{сортирует 3-строку из INPUT в OUTPUT}
  VAR Ch1, Ch2, Ch3: CHAR;
  BEGIN {MinSort3}
    READ(Ch1, Ch2, Ch3);
    WRITELN('Входные данные ', Ch1, Ch2, Ch3);
    WRITE('Сортированные данные ');
    {Печатать минимум в  OUTPUT, сохранить содержимое в Ch1 and Ch2 };
    { Сортировать Ch1, Ch2 в OUTPUT };
    WRITELN
 END.{Minsort3}

